particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
    if (!initialized_) {
        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        uint32_t appRamStart = 0;
        int ret = nrf_sdh_ble_default_cfg_set(BLE_CONN_CFG_TAG, &appRamStart);
        CHECK_NRF_RETURN(ret, nrf_system_error(ret));
        LOG_DEBUG(TRACE, "APP RAM start: 0x%08x", (unsigned)appRamStart);
        // Enable the stack
        uint32_t sdRamEnd = appRamStart;
        ret = nrf_sdh_ble_enable(&sdRamEnd);
        LOG_DEBUG(TRACE, "SoftDevice RAM end: 0x%08x", (unsigned)sdRamEnd);
        if (sdRamEnd >= appRamStart) {
            LOG(ERROR, "Need to change APP_RAM_BASE in linker script to be large than: 0x%08x", (unsigned)sdRamEnd - 0x20000000);
        }
        SPARK_ASSERT(sdRamEnd < appRamStart);
        CHECK_NRF_RETURN(ret, nrf_system_error(ret));
        if (!dispatcher_) {
            dispatcher_.reset(new(std::nothrow) BleEventDispatcher());
            CHECK_TRUE(dispatcher_, SYSTEM_ERROR_NO_MEMORY);
            CHECK(dispatcher_->init());
        }
        if (!gap_) {
            gap_.reset(new(std::nothrow) BleGap());
            CHECK_TRUE(gap_, SYSTEM_ERROR_NO_MEMORY);
            CHECK(gap_->init());
        }
        if (!broadcaster_) {
            broadcaster_.reset(new(std::nothrow) Broadcaster());
            CHECK_TRUE(broadcaster_, SYSTEM_ERROR_NO_MEMORY);
            CHECK(broadcaster_->init());
        }
        if (!observer_) {
            observer_.reset(new(std::nothrow) Observer());
            CHECK_TRUE(observer_, SYSTEM_ERROR_NO_MEMORY);
            CHECK(observer_->init());
        }
        if (!connectionsMgr_) {
            connectionsMgr_.reset(new(std::nothrow) ConnectionsManager());
            CHECK_TRUE(connectionsMgr_, SYSTEM_ERROR_NO_MEMORY);
            CHECK(connectionsMgr_->init());
        }
        if (!gatts_) {
            gatts_.reset(new(std::nothrow) GattServer());
            CHECK_TRUE(gatts_, SYSTEM_ERROR_NO_MEMORY);
            CHECK(gatts_->init());
        }
        if (!gattc_) {
            gattc_.reset(new(std::nothrow) GattClient());
            CHECK_TRUE(gattc_, SYSTEM_ERROR_NO_MEMORY);
            CHECK(gattc_->init());
        }
        initialized_ = true;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::selectAntenna(hal_ble_ant_type_t antenna) const {
#if (PLATFORM_ID == PLATFORM_XENON_SOM) || (PLATFORM_ID == PLATFORM_ARGON_SOM) || (PLATFORM_ID == PLATFORM_BORON_SOM)
    // Mesh SoM don't have on-board antenna switch.
    return SYSTEM_ERROR_NOT_SUPPORTED;
#else
    HAL_Pin_Mode(ANTSW1, OUTPUT);
#if (PLATFORM_ID == PLATFORM_XENON) || (PLATFORM_ID == PLATFORM_ARGON)
    HAL_Pin_Mode(ANTSW2, OUTPUT);
#endif
    if (antenna == BLE_ANT_EXTERNAL) {
#if (PLATFORM_ID == PLATFORM_ARGON)
        HAL_GPIO_Write(ANTSW1, 1);
        HAL_GPIO_Write(ANTSW2, 0);
#elif (PLATFORM_ID == PLATFORM_BORON)
        HAL_GPIO_Write(ANTSW1, 0);
#else
        HAL_GPIO_Write(ANTSW1, 0);
        HAL_GPIO_Write(ANTSW2, 1);
#endif
    } else {
#if (PLATFORM_ID == PLATFORM_ARGON)
        HAL_GPIO_Write(ANTSW1, 0);
        HAL_GPIO_Write(ANTSW2, 1);
#elif (PLATFORM_ID == PLATFORM_BORON)
        HAL_GPIO_Write(ANTSW1, 1);
#else
        HAL_GPIO_Write(ANTSW1, 1);
        HAL_GPIO_Write(ANTSW2, 0);
#endif
    }
    return SYSTEM_ERROR_NONE;
#endif // (PLATFORM_ID == PLATFORM_XENON_SOM) || (PLATFORM_ID == PLATFORM_ARGON_SOM) || (PLATFORM_ID == PLATFORM_ARGON_SOM)
}

int BleObject::toPlatformUUID(const hal_ble_uuid_t* halUuid, ble_uuid_t* uuid) {
    if (uuid == nullptr || halUuid == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (halUuid->type == BLE_UUID_TYPE_128BIT) {
        ble_uuid128_t uuid128;
        memcpy(uuid128.uuid128, halUuid->uuid128, BLE_SIG_UUID_128BIT_LEN);
        ret_code_t ret = sd_ble_uuid_vs_add(&uuid128, &uuid->type);
        CHECK_NRF_RETURN(ret, nrf_system_error(ret));
        ret = sd_ble_uuid_decode(BLE_SIG_UUID_128BIT_LEN, halUuid->uuid128, uuid);
        CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    } else if (halUuid->type == BLE_UUID_TYPE_16BIT) {
        uuid->type = BLE_UUID_TYPE_BLE;
        uuid->uuid = halUuid->uuid16;
    } else {
        uuid->type = BLE_UUID_TYPE_UNKNOWN;
        uuid->uuid = halUuid->uuid16;
    }
    return SYSTEM_ERROR_NONE;
}

int BleObject::toHalUUID(const ble_uuid_t* uuid, hal_ble_uuid_t* halUuid) {
    if (uuid == nullptr || halUuid == nullptr) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (uuid->type == BLE_UUID_TYPE_BLE) {
        halUuid->type = BLE_UUID_TYPE_16BIT;
        halUuid->uuid16 = uuid->uuid;
        return SYSTEM_ERROR_NONE;
    } else if (uuid->type != BLE_UUID_TYPE_UNKNOWN) {
        uint8_t uuidLen;
        halUuid->type = BLE_UUID_TYPE_128BIT;
        ret_code_t ret = sd_ble_uuid_encode(uuid, &uuidLen, halUuid->uuid128);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_uuid_encode() failed: %u", (unsigned)ret);
            halUuid->type = BLE_UUID_TYPE_128BIT_SHORTED;
            halUuid->uuid16 = uuid->uuid;
            return nrf_system_error(ret);
        }
        return SYSTEM_ERROR_NONE;
    }
    halUuid->type = BLE_UUID_TYPE_128BIT_SHORTED;
    halUuid->uuid16 = uuid->uuid;
    return SYSTEM_ERROR_UNKNOWN;
}


/**********************************************
 * Particle BLE APIs
 */
int hal_ble_lock(void* reserved) {
    return !s_bleMutex.lock();
}

int hal_ble_unlock(void* reserved) {
    return !s_bleMutex.unlock();
}

int hal_ble_stack_init(void* reserved) {
    BleLock lk;
    /* The SoftDevice has been enabled in core_hal.c */
    LOG_DEBUG(TRACE, "hal_ble_stack_init().");
    return BleObject::getInstance().init();
}

int hal_ble_select_antenna(hal_ble_ant_type_t antenna, void* reserved) {
    return BleObject::getInstance().selectAntenna(antenna);
}

int hal_ble_set_callback_on_events(on_ble_evt_cb_t callback, void* context, void* reserved) {
    BleLock lk;
    BleObject::getInstance().dispatcher()->onGenericEventCallback(callback, context);
    return SYSTEM_ERROR_NONE;
}

/**********************************************
 * BLE GAP APIs
 */
int hal_ble_gap_set_device_address(const hal_ble_addr_t* address, void* reserved) {
    BleLock lk;
    LOG_DEBUG(TRACE, "hal_ble_gap_set_device_address().");
    return BleObject::getInstance().gap()->setDeviceAddress(address);
}

